W6/W6D3/art_share/app/controllers/artworks_controller.rb

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Test"], ["image_url", "\"\""], ["artist_id", 27]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "Test2"], ["id", 17]]