W6/W6D3/art_share/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 16], ["viewer_id", 27]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save!

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 27]]
---
    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        @artwork_share.destroy