W6/W6D3/art_share/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        if @comment.save!
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 22], ["artwork_id", 14], ["body", "This is cool art"]]

    def index

        if params.has_key?(:user_id)
            @parent = User.find(params[:user_id])
        elsif params.has_key?(:artwork_id)
            @parent = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]