W6/W6D3/art_share/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Picasso"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if params.has_key?(:username)
            @user = User.find_by_username(params[:username])
        else
            @user = User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Lobster"], ["email", "lobster@gmail.com"]]
---
    def create
        @user = User.new(user_params)
        if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "test2"], ["id", 27]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)