W7/W7D2/music_app/app/views/tracks/edit.html.erb

SELECT "albums".* FROM "albums"
---
        <option></option>
        <% Album.all.each do |album| %>