W7/W7D2/music_app/app/views/albums/new.html.erb

        <option></option>
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"