W6/W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "description", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", " Is a bad cat"], ["updated_at", "2022-07-01 21:02:06.896028"], ["id", 2]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update_attributes(cat_params)