W7/W7D5/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Deb"], ["description", "all about me"], ["user_id", 1], ["created_at", "2022-07-08 02:26:33.480341"], ["updated_at", "2022-07-08 02:26:33.480341"]]
---
    def create
        @sub = current_user.subs.new(sub_params)
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", " value=\"all about me"], ["updated_at", "2022-07-08 02:57:16.170398"], ["id", 1]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def require_user_moderator
        return if current_user.subs.find_by(id: params[:id])